// Написать программу, которая находит частное двух чисел введенных с клавиатуры

Console.WriteLine("Введите первое число");
double numberA = double.Parse(Console.ReadLine());
Console.WriteLine("Введите второе число");
double numberB = double.Parse(Console.ReadLine());
Console.WriteLine(numberA / numberB);
